amlweems/wiced-history/WICED/Platform/common/ARM_Cortex_M3/STM32F1xx/stm32f1xx_platform.c
/*
 * Copyright 2014, Broadcom Corporation
 * All Rights Reserved.
 *
 * This is UNPUBLISHED PROPRIETARY SOURCE CODE of Broadcom Corporation;
 * the contents of this file may not be disclosed to third parties, copied
 * or duplicated in any form, in whole or in part, without the prior
 * written permission of Broadcom Corporation.
 */

/** @file
 *
 */
#include "platform.h"
#include "wiced_platform.h"
#include "stm32f10x.h"
#include "stm32f10x_dma.h"
#include "stm32f10x_adc.h"
#include "stm32f10x_pwr.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_spi.h"
#include "stm32f10x_rtc.h"
#include "stm32f10x_usart.h"
#include "stm32f10x_tim.h"
#include "stm32f10x_bkp.h"
#include "gpio_irq.h"
#include "watchdog.h"
#include "stdio.h"
#include "string.h"
#include "wwd_assert.h"
#include "platform_common_config.h"
#include "stm32f1xx_platform.h"
#include "platform_dct.h"
#include "Platform/wwd_platform_interface.h"
#include "crt0.h"
#include "platform_sleep.h"
#ifdef __GNUC__
#include "../../GCC/stdio_newlib.h"
#endif /* ifdef __GNUC__ */

#ifdef __GNUC__
#define WEAK __attribute__ ((weak))
#elif defined ( __IAR_SYSTEMS_ICC__ )
#define WEAK
#endif /* ifdef __GNUC__ */

#ifndef WICED_DISABLE_BOOTLOADER
#include "bootloader_app.h"
#endif

/******************************************************
 *                      Macros
 ******************************************************/

#define FLASH_ADDRESS_TO_PAGE( address )     ((uint16_t) ( ( address - FLASH_START_ADDR ) / PLATFORM_FLASH_PAGE_SIZE ))

#define ERASE_DCT_1()              platform_erase_flash( FLASH_ADDRESS_TO_PAGE(PLATFORM_DCT_COPY1_START_ADDRESS), FLASH_ADDRESS_TO_PAGE(PLATFORM_DCT_COPY1_END_ADDRESS) )
#define ERASE_DCT_2()              platform_erase_flash( FLASH_ADDRESS_TO_PAGE(PLATFORM_DCT_COPY2_START_ADDRESS), FLASH_ADDRESS_TO_PAGE(PLATFORM_DCT_COPY2_END_ADDRESS) )

/******************************************************
 *                    Constants
 ******************************************************/

#define MAX_NUM_SPI_PRESCALERS    (8)
#define SPI_DMA_TIMEOUT_LOOPS     (10000)

#define FLASH_START_ADDR     ((uint32_t)&flash_start_addr_loc)
#define APP_HDR_START_ADDR   ((uint32_t)&app_hdr_start_addr_loc)
#define DCT1_START_ADDR      ((uint32_t)&dct1_start_addr_loc)
#define DCT1_SIZE            ((uint32_t)&dct1_size_loc)
#define DCT2_START_ADDR      ((uint32_t)&dct2_start_addr_loc)
#define DCT2_SIZE            ((uint32_t)&dct2_size_loc)
#define SRAM_START_ADDR      ((uint32_t)&sram_start_addr_loc)
#define SRAM_SIZE            ((uint32_t)&sram_size_loc)


#define FLASH_WRITE_FUNC    ( FLASH_ProgramHalfWord )
#define FLASH_WRITE_SIZE    ( 4 )

/* first dct copy definitions */
#define PLATFORM_DCT_COPY1_START_ADDRESS     ( DCT1_START_ADDR )
#define PLATFORM_MAX_DCT_SIZE                ( DCT1_SIZE     )
#define PLATFORM_DCT_COPY1_END_ADDRESS       ( PLATFORM_DCT_COPY1_START_ADDRESS + PLATFORM_MAX_DCT_SIZE )

/* second dct copy definitions  */
#define PLATFORM_DCT_COPY2_START_ADDRESS     ( DCT2_START_ADDR )
#define PLATFORM_DCT_COPY2_END_ADDRESS       ( PLATFORM_DCT_COPY2_START_ADDRESS + PLATFORM_MAX_DCT_SIZE )
/* for stm33f103 the size of the page is 2k !!!! , it depends on the type of the stm32f1 device, high, low and medium density devices exist */
#define PLATFORM_FLASH_PAGE_SIZE             ( 2*1024    )

#ifndef STDIO_BUFFER_SIZE
#define STDIO_BUFFER_SIZE   64
#endif

/******************************************************
 *                   Enumerations
 ******************************************************/

/******************************************************
 *                 Type Definitions
 ******************************************************/

typedef uint32_t flash_write_t;

/******************************************************
 *                    Structures
 ******************************************************/

typedef struct
{
    uint32_t               rx_size;
    wiced_ring_buffer_t*   rx_buffer;
    host_semaphore_type_t  rx_complete;
    host_semaphore_type_t  tx_complete;
    const uint8_t*         tx_buffer;
    uint32_t               tx_size;
	wiced_result_t         tx_dma_result;
    wiced_result_t         rx_dma_result;
} uart_interface_t;

typedef struct
{
    uint16_t factor;
    uint16_t prescaler_value;
} spi_baudrate_division_mapping_t;

/******************************************************
 *               Function Declarations
 ******************************************************/

static wiced_result_t wiced_spi_configure_baudrate( uint32_t speed, uint16_t* prescaler );
static wiced_result_t spi_dma_transfer( const wiced_spi_device_t* spi );
static void           spi_dma_config( const wiced_spi_device_t* spi, wiced_spi_message_segment_t* message );
static wiced_result_t platform_uart_init( wiced_uart_t uart, const wiced_uart_config_t* config, wiced_ring_buffer_t* optional_rx_buffer );
static wiced_result_t platform_uart_receive_bytes( wiced_uart_t uart, void* data, uint32_t size, uint32_t timeout );


#ifndef WICED_DISABLE_MCU_POWERSAVE
#define STOP_MODE_SUPPORT
#endif /* ifndef WICED_DISABLE_MCU_POWERSAVE */



void RTC_init(void);
void stm32f1xx_clocks_needed( void );
void stm32f1xx_clocks_not_needed( void );

void usart1_irq( void );
void usart2_irq( void );
void RTCAlarm_irq( void );

#ifndef PLATFORM_DISABLE_UART_DMA
void usart1_tx_dma_irq( void );
void usart2_tx_dma_irq( void );
void usart1_rx_dma_irq( void );
void usart2_rx_dma_irq( void );
#endif

/******************************************************
 *               Variables Definitions
 ******************************************************/

/* These come from the linker script */
extern void* dct1_start_addr_loc;
extern void* dct1_size_loc;
extern void* dct2_start_addr_loc;
extern void* dct2_size_loc;
extern void* app_hdr_start_addr_loc;
extern void* sram_start_addr_loc;
extern void* sram_size_loc;
extern void* flash_start_addr_loc;

static uart_interface_t uart_interfaces[NUMBER_OF_UART_INTERFACES];

static const uint32_t spi_transfer_complete_flags[]=
{
    /* for every stream get a transfer complete flag */
    [0] =  DMA1_FLAG_TC1,
    [1] =  DMA1_FLAG_TC2,
    [2] =  DMA1_FLAG_TC3,
    [3] =  DMA1_FLAG_TC4,
    [4] =  DMA1_FLAG_TC5,
    [5] =  DMA1_FLAG_TC6,
    [6] =  DMA1_FLAG_TC7,
};

static const spi_baudrate_division_mapping_t spi_baudrate_prescalers[MAX_NUM_SPI_PRESCALERS] =
{
    { 2,   SPI_BaudRatePrescaler_2   },
    { 4,   SPI_BaudRatePrescaler_4   },
    { 8,   SPI_BaudRatePrescaler_8   },
    { 16,  SPI_BaudRatePrescaler_16  },
    { 32,  SPI_BaudRatePrescaler_32  },
    { 64,  SPI_BaudRatePrescaler_64  },
    { 128, SPI_BaudRatePrescaler_128 },
    { 256, SPI_BaudRatePrescaler_256 },
};

static char stm32_platform_inited = 0;

