amlweems/wiced-history/WICED/Platform/common/ARM_Cortex_M3/STM32F1xx/stm32f1xx_platform.c
#ifndef WICED_DISABLE_STDIO
static const wiced_uart_config_t stdio_uart_config =
{
    .baud_rate    = 115200,
    .data_width   = DATA_WIDTH_8BIT,
    .parity       = NO_PARITY,
    .stop_bits    = STOP_BITS_1,
    .flow_control = FLOW_CONTROL_DISABLED,
};


static volatile wiced_ring_buffer_t stdio_rx_buffer;
static volatile uint8_t             stdio_rx_data[STDIO_BUFFER_SIZE];
static host_semaphore_type_t        stdio_rx_mutex;
static host_semaphore_type_t        stdio_tx_mutex;
#endif /* #ifndef WICED_DISABLE_STDIO */

static volatile uint8_t uart_break;

static const uint16_t adc_sampling_cycle[] =
{
    [ADC_SampleTime_1Cycles5  ] = 1,
    [ADC_SampleTime_7Cycles5  ] = 7,
    [ADC_SampleTime_13Cycles5 ] = 13,
    [ADC_SampleTime_28Cycles5 ] = 28,
    [ADC_SampleTime_41Cycles5 ] = 41,
    [ADC_SampleTime_55Cycles5 ] = 55,
    [ADC_SampleTime_71Cycles5 ] = 71,
    [ADC_SampleTime_239Cycles5] = 239,
};

/******************************************************
 *               Function Definitions
 ******************************************************/

/* STM32F1 common clock initialisation function
 * - weak attribute is intentional in case a specific platform (board) needs to override this.
 */
WEAK void init_clocks( void )
{
    /* Configure Clocks */
    RCC_DeInit( );

    RCC_HSEConfig( HSE_SOURCE );
    RCC_WaitForHSEStartUp( );

    RCC_HCLKConfig( AHB_CLOCK_DIVIDER );
    RCC_PCLK1Config( APB1_CLOCK_DIVIDER ); /* PCLK1 max = 36MHz */
    RCC_PCLK2Config( APB2_CLOCK_DIVIDER ); /* PCLK2 max = 36MHz */

    /* Enable the PLL */
    FLASH_SetLatency( INT_FLASH_WAIT_STATE );
    FLASH_PrefetchBufferCmd( ENABLE );

    /* CPU_CLOCK_HZ = RCC_PLLSource * RCC_PLLMul
     */
    RCC_PLLConfig( PLL_SOURCE, PLL_MULTIPLIER_CONSTANT ); /* NOTE: The CPU Clock Frequency is independently defined in <WICED-SDK>/Wiced/Platform/<platform>/<platform>.mk */
    RCC_PLLCmd( ENABLE );

    while ( RCC_GetFlagStatus( RCC_FLAG_PLLRDY ) == RESET )
    {
    }
    RCC_SYSCLKConfig( SYSTEM_CLOCK_SOURCE );

    while ( RCC_GetSYSCLKSource( ) != 0x08 )
    {
    }

    /* Configure HCLK clock as SysTick clock source. */
    SysTick_CLKSourceConfig( SYSTICK_CLOCK_SOURCE );

#ifndef WICED_DISABLE_STDIO
    {
		USART_ClockInitTypeDef usart_clock_init_structure;
		STDIO_CLOCK_CMD( STDIO_PERIPH_CLOCK, ENABLE );

		usart_clock_init_structure.USART_Clock   = USART_Clock_Disable;
		usart_clock_init_structure.USART_CPOL    = USART_CPOL_Low;
		usart_clock_init_structure.USART_CPHA    = USART_CPHA_2Edge;
		usart_clock_init_structure.USART_LastBit = USART_LastBit_Disable;

		USART_ClockInit( STDIO_USART, &usart_clock_init_structure );
    }
#endif /* ifdef WICED_DISABLE_STDIO */
}

WEAK void init_memory( void )
{

}

void init_architecture( void )
{
    uint8_t i;

    if ( stm32_platform_inited == 1 )
        return;

    watchdog_init( );

    /* Initialise the interrupt priorities to a priority lower than 0 so that the BASEPRI register can mask them */
    for ( i = 0; i < 81; i++ )
    {
        NVIC->IP[i] = 0xff;
    }

    NVIC_PriorityGroupConfig( NVIC_PriorityGroup_4 );

#ifndef WICED_DISABLE_STDIO
    host_rtos_init_semaphore( &stdio_tx_mutex );
    host_rtos_set_semaphore ( &stdio_tx_mutex, WICED_FALSE );
    host_rtos_init_semaphore( &stdio_rx_mutex );
    host_rtos_set_semaphore ( &stdio_rx_mutex, WICED_FALSE );
    ring_buffer_init  ( (wiced_ring_buffer_t*)&stdio_rx_buffer, (uint8_t*)stdio_rx_data, STDIO_BUFFER_SIZE );
    platform_uart_init( STDIO_UART, &stdio_uart_config, (wiced_ring_buffer_t*)&stdio_rx_buffer );
#endif

    /* Ensure 802.11 device is in reset. */
    host_platform_init( );

#ifdef STOP_MODE_SUPPORT
    RTC_init( );

    /* Disable MCU powersave at start-up. Application must explicitly enable MCU powersave if desired */
    stm32f1xx_clocks_needed();
#endif /* ifdef STOP_MODE_SUPPORT */

    stm32_platform_inited = 1;
}

static wiced_result_t wiced_spi_configure_baudrate( uint32_t speed, uint16_t* prescaler )
{
    uint8_t i;

    wiced_assert("Bad args", prescaler != NULL);

    for( i = 0 ; i < MAX_NUM_SPI_PRESCALERS ; i++ )
    {
        if( ( 60000000 / spi_baudrate_prescalers[i].factor ) <= speed )
        {
            *prescaler = spi_baudrate_prescalers[i].prescaler_value;
            return WICED_SUCCESS;
        }
    }

    return WICED_ERROR;
}

static wiced_result_t spi_dma_transfer( const wiced_spi_device_t* spi )
{
    uint32_t loop_count;

    /* enable dma channels that have just been configured */
    DMA_Cmd(spi_mapping[spi->port].rx_dma_channel, ENABLE);
    DMA_Cmd(spi_mapping[spi->port].tx_dma_channel, ENABLE);

    /* Wait for DMA to complete */
    loop_count = 0;
    while ( ( DMA_GetFlagStatus( spi_transfer_complete_flags[spi_mapping[spi->port].rx_dma_channel_number - 1] ) == RESET ) && ( loop_count < (uint32_t) SPI_DMA_TIMEOUT_LOOPS ) )
    {
        loop_count++;
    }

    if ( loop_count >= (uint32_t) SPI_DMA_TIMEOUT_LOOPS )
    {
        /* dma is still in transfer and timeout occured, perhaps dma was not configured properly */
        /* it cant still run */
        return WICED_TIMEOUT;
    }

    /* dma is finished */
    return WICED_SUCCESS;
}

static void spi_dma_config( const wiced_spi_device_t* spi, wiced_spi_message_segment_t* message )
{
    uint8_t dummy = 0xFF;
    DMA_InitTypeDef dma_init;

    /* check arguments */
    if( !message )
    {
        /* no message is specified */
        return;
    }

    /* Setup DMA for SPI TX if it is enabled */
    DMA_DeInit( spi_mapping[spi->port].tx_dma_channel );
    /* setup dma stream for TX */
    dma_init.DMA_PeripheralBaseAddr = ( uint32_t )&spi_mapping[spi->port].spi_regs->DR;
    dma_init.DMA_DIR = DMA_DIR_PeripheralDST;
    dma_init.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    dma_init.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    dma_init.DMA_BufferSize = message->length;
    dma_init.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    dma_init.DMA_Mode = DMA_Mode_Normal;
    dma_init.DMA_Priority = DMA_Priority_VeryHigh;

    if( message->tx_buffer )
    {
       dma_init.DMA_MemoryBaseAddr = ( uint32_t )message->tx_buffer;
       dma_init.DMA_MemoryInc = DMA_MemoryInc_Enable;
    }
    else
    {
       dma_init.DMA_MemoryBaseAddr = ( uint32_t )(&dummy);
       dma_init.DMA_MemoryInc = DMA_MemoryInc_Disable;
    }

    DMA_Init( spi_mapping[spi->port].tx_dma_channel, &dma_init );

    /* activate spi dma mode for transmission */
    SPI_I2S_DMACmd( spi_mapping[spi->port].spi_regs, SPI_I2S_DMAReq_Tx, ENABLE );
    /* init tx dma finish semaphore  */
    /* !!!!!!!!!!!!!!!!!!!!!!!!!!!!! */

