amlweems/wiced-history/WICED/Platform/common/ARM_Cortex_M3/STM32F1xx/stm32f1xx_platform.c
    /* setup dma for SPI RX dma stream */
    DMA_DeInit( spi_mapping[spi->port].rx_dma_channel );
    dma_init.DMA_PeripheralBaseAddr = ( uint32_t )&spi_mapping[spi->port].spi_regs->DR;
    dma_init.DMA_DIR = DMA_DIR_PeripheralSRC;
    dma_init.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    dma_init.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    dma_init.DMA_BufferSize = message->length;
    dma_init.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    dma_init.DMA_Mode = DMA_Mode_Normal;
    dma_init.DMA_Priority = DMA_Priority_VeryHigh;
    if( message->rx_buffer )
    {
        dma_init.DMA_MemoryBaseAddr = (uint32_t)message->rx_buffer;
        dma_init.DMA_MemoryInc = DMA_MemoryInc_Enable;
    }
    else
    {
        dma_init.DMA_MemoryBaseAddr = (uint32_t)&dummy;
        dma_init.DMA_MemoryInc = DMA_MemoryInc_Disable;
    }
    /* init st dma channel */
    DMA_Init( spi_mapping[spi->port].rx_dma_channel, &dma_init );
    /* activate spi dma mode for reception */
    SPI_I2S_DMACmd( spi_mapping[spi->port].spi_regs, SPI_I2S_DMAReq_Rx, ENABLE );
    /* init rx dma finish semaphore */
    /* !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! */

    return;
}

wiced_result_t wiced_spi_init( const wiced_spi_device_t* spi )
{
    uint16_t prescaler;
    wiced_result_t res;
    SPI_InitTypeDef spi_init;
    GPIO_InitTypeDef gpio_init_structure;

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed( );
#endif

    /* Init SPI GPIOs */
    gpio_init_structure.GPIO_Mode  = GPIO_Mode_AF_PP;
    gpio_init_structure.GPIO_Speed = GPIO_Speed_50MHz;
    gpio_init_structure.GPIO_Pin   = ((uint16_t) (1 << spi_mapping[spi->port].pin_clock->number) ) |
                                     ((uint16_t) (1 << spi_mapping[spi->port].pin_miso->number ) ) |
                                     ((uint16_t) (1 << spi_mapping[spi->port].pin_mosi->number ) );
    GPIO_Init( spi_mapping[spi->port].pin_clock->bank, &gpio_init_structure );

    /* Init the chip select GPIO */
    wiced_gpio_init(spi->chip_select, OUTPUT_PUSH_PULL);
    wiced_gpio_output_high(spi->chip_select);

    /* Ensure the ADC and GPIOA are enabled */
    RCC_APB2PeriphClockCmd( spi_mapping[spi->port].pin_clock->peripheral_clock, ENABLE);
    RCC_APB2PeriphClockCmd( spi_mapping[spi->port].peripheral_clock_reg, ENABLE );

    /* Configure baudrate */
    if ( ( res = wiced_spi_configure_baudrate( spi->speed, &prescaler ) != WICED_SUCCESS ) )
    {
#ifdef STOP_MODE_SUPPORT
        stm32f1xx_clocks_not_needed( );
#endif
        return res;
    }
    spi_init.SPI_BaudRatePrescaler = prescaler;

    /* Configure data-width */
    if ( spi->bits == 8 )
    {
        spi_init.SPI_DataSize = SPI_DataSize_8b;
    }
    else if ( spi->bits == 16 )
    {
        if ( spi->mode & SPI_USE_DMA )
        {
#ifdef STOP_MODE_SUPPORT
            stm32f1xx_clocks_not_needed( );
#endif
            return WICED_ERROR;
        }
        spi_init.SPI_DataSize = SPI_DataSize_16b;
    }
    else
    {
#ifdef STOP_MODE_SUPPORT
        stm32f1xx_clocks_not_needed( );
#endif
        return WICED_NOTFOUND;
    }

    /* Configure MSB or LSB */
    if ( spi->mode & SPI_MSB_FIRST )
    {
        spi_init.SPI_FirstBit = SPI_FirstBit_MSB;
    }
    else
    {
        spi_init.SPI_FirstBit = SPI_FirstBit_LSB;
    }

    /* Configure mode CPHA and CPOL, msb or lsb first */
    if ( spi->mode & SPI_CLOCK_IDLE_HIGH )
    {
        spi_init.SPI_CPOL = SPI_CPOL_High;
    }
    else
    {
        spi_init.SPI_CPOL = SPI_CPOL_Low;
    }

    if ( spi->mode & SPI_CLOCK_RISING_EDGE )
    {
        spi_init.SPI_CPHA = ( spi->mode & SPI_CLOCK_IDLE_HIGH ) ? SPI_CPHA_2Edge : SPI_CPHA_1Edge;
    }
    else
    {
        spi_init.SPI_CPHA = ( spi->mode & SPI_CLOCK_IDLE_HIGH ) ? SPI_CPHA_1Edge : SPI_CPHA_2Edge;
    }
    spi_init.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    spi_init.SPI_Mode = SPI_Mode_Master;
    spi_init.SPI_NSS = SPI_NSS_Soft;
    SPI_CalculateCRC( spi_mapping[spi->port].spi_regs, DISABLE );

    /* Init and enable SPI */
    SPI_Init( spi_mapping[spi->port].spi_regs, &spi_init );
    SPI_Cmd ( spi_mapping[spi->port].spi_regs, ENABLE );

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed( );
#endif /* #ifdef STOP_MODE_SUPPORT */

    return WICED_SUCCESS;
}

wiced_result_t wiced_spi_transfer( const wiced_spi_device_t* spi, wiced_spi_message_segment_t* segments, uint16_t number_of_segments )
{
    wiced_result_t res;
    uint32_t count = 0;
    uint16_t i = 0;

    /* check whether SPI port is supported by the current platform */
    if( spi->port != WICED_SPI_1 )
    {
        return WICED_NOTFOUND;
    }
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

//    if( ( !msgs ) || ( !num_msgs ) )
//    {
//        return WICED_BADARG;
//    }
    /* Activate chip select */
    wiced_gpio_output_low(spi->chip_select);


    for( i = 0; i < number_of_segments; i++ )
    {
        if( spi->mode & SPI_USE_DMA )
        {
            spi_dma_config(spi, &segments[i]);
            res = spi_dma_transfer( spi );
            if( res != WICED_SUCCESS )
            {
#ifdef STOP_MODE_SUPPORT
                stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
                /* return with an error */
                return res;
            }
        }
        else
        {
            /* in interrupt-less mode */
            if( spi->bits == 8 )
            {
            	const uint8_t* send_ptr;
            	uint8_t*       rcv_ptr;

                count    = segments[i].length;
                send_ptr = segments[i].tx_buffer;
                rcv_ptr  = segments[i].rx_buffer;
                while ( count-- )
                {
                    uint8_t data;
                    if ( send_ptr != NULL )
                    {
                        data = *send_ptr;
                        send_ptr++;
                    }
                    else
                    {
                        data = 0xFF;
                    }

                    /* Wait until the transmit buffer is empty */
                    while ( SPI_I2S_GetFlagStatus( spi_mapping[spi->port].spi_regs, SPI_I2S_FLAG_TXE ) == RESET )
                    {}

                    /* Send the byte */
                    SPI_I2S_SendData(spi_mapping[spi->port].spi_regs, data);

