amlweems/wiced-history/WICED/Platform/common/ARM_Cortex_M3/STM32F1xx/stm32f1xx_platform.c
                    /* Wait until a data is received */
                   while ( SPI_I2S_GetFlagStatus( spi_mapping[spi->port].spi_regs, SPI_I2S_FLAG_RXNE ) == RESET )
                   {}

                    /* Get the received data */
                    data = (uint8_t) (0xff & SPI_I2S_ReceiveData( spi_mapping[spi->port].spi_regs ));

                    if ( rcv_ptr != NULL )
                    {
                        *rcv_ptr++ = data;
                    }
                }
            }
            else if( spi->bits == 16 )
            {
                const uint16_t * send_ptr = ( const uint16_t * )segments[i].tx_buffer;
                uint16_t * rcv_ptr = ( uint16_t * )segments[i].rx_buffer;
                if( ( count % 2 ) )
                {
#ifdef STOP_MODE_SUPPORT
                    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
                    /* message length must be an even number if word tranfer mode was selected */
                    return WICED_ERROR;
                }

                while( count )
                {
                	uint16_t data;

                    count -= 2;
                    data = 0xFFFF;

                    if ( send_ptr != NULL )
                    {
                        data = *send_ptr++;
                    }

                    /* Wait until the transmit buffer is empty */
                    while (SPI_I2S_GetFlagStatus(spi_mapping[spi->port].spi_regs, SPI_I2S_FLAG_TXE) == RESET)
                    {}

                    /* Send the byte */
                    SPI_I2S_SendData(spi_mapping[spi->port].spi_regs, data);

                    /* Wait until a data is received */
                    while (SPI_I2S_GetFlagStatus(spi_mapping[spi->port].spi_regs, SPI_I2S_FLAG_RXNE) == RESET)
                    {}

                    /* Get the received data */
                    data = SPI_I2S_ReceiveData(spi_mapping[spi->port].spi_regs);

                    if ( rcv_ptr != NULL )
                    {
                        *rcv_ptr++ = data;
                    }
                }
            }
        }
    }
    /* Activate chip select */
    wiced_gpio_output_high(spi->chip_select);

#if 0
    /* for interrupt */

#endif
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    return WICED_SUCCESS;
}

wiced_result_t wiced_spi_deinit( const wiced_spi_device_t* spi )
{
    GPIO_InitTypeDef gpio_init_structure;

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    /* De-init and disable SPI */
    SPI_Cmd( spi_mapping[ spi->port ].spi_regs, DISABLE );
    SPI_I2S_DeInit( spi_mapping[ spi->port ].spi_regs );

    /* Disable SPI peripheral clock */
    RCC_APB2PeriphClockCmd( spi_mapping[spi->port].pin_clock->peripheral_clock, DISABLE);
    RCC_APB2PeriphClockCmd( spi_mapping[spi->port].peripheral_clock_reg, DISABLE );


    gpio_init_structure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    gpio_init_structure.GPIO_Speed = GPIO_Speed_50MHz;
    gpio_init_structure.GPIO_Pin   = ((uint16_t) (1 << spi_mapping[spi->port].pin_clock->number) ) |
                                     ((uint16_t) (1 << spi_mapping[spi->port].pin_miso->number ) ) |
                                     ((uint16_t) (1 << spi_mapping[spi->port].pin_mosi->number ) );
    GPIO_Init( spi_mapping[spi->port].pin_clock->bank, &gpio_init_structure );

    /* Reset CS pin to input floating state */
    wiced_gpio_init( spi->chip_select, INPUT_HIGH_IMPEDANCE );

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    return WICED_SUCCESS;
}

wiced_result_t wiced_i2c_init( wiced_i2c_device_t* device )
{
    UNUSED_PARAMETER( device );
    wiced_assert( "unimplemented", 0!=0 );
    return WICED_SUCCESS;
}

wiced_bool_t wiced_i2c_probe_device( wiced_i2c_device_t* device, int retries )
{
    UNUSED_PARAMETER( device );
    UNUSED_PARAMETER( retries );
    wiced_assert( "unimplemented", 0!=0 );
    return WICED_SUCCESS;
}

wiced_result_t wiced_i2c_transfer( wiced_i2c_device_t* device, wiced_i2c_message_t* message, uint16_t number_of_messages )
{
    UNUSED_PARAMETER( device );
    UNUSED_PARAMETER( message );
    UNUSED_PARAMETER( number_of_messages );
    wiced_assert( "unimplemented", 0!=0 );
    return WICED_SUCCESS;
}

wiced_result_t wiced_i2c_deinit( wiced_i2c_device_t* device )
{
    UNUSED_PARAMETER( device );
    wiced_assert( "unimplemented", 0!=0 );
    return WICED_SUCCESS;
}

wiced_result_t wiced_adc_init( wiced_adc_t adc, uint32_t sampling_cycle )
{
    /* Initialize the associated GPIO */
    GPIO_InitTypeDef gpio_init_structure;
    ADC_InitTypeDef adc_init_structure;
    uint8_t a;

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    gpio_init_structure.GPIO_Pin   = (uint16_t) ( 1 << adc_mapping[adc].pin->number );
    gpio_init_structure.GPIO_Speed = (GPIOSpeed_TypeDef) 0;
    gpio_init_structure.GPIO_Mode  = GPIO_Mode_AIN;
    GPIO_Init( adc_mapping[adc].pin->bank, &gpio_init_structure );

    /* Ensure the ADC and GPIOA are enabled */
    RCC_APB2PeriphClockCmd( adc_mapping[adc].pin->peripheral_clock, ENABLE);
    RCC_APB2PeriphClockCmd( adc_mapping[adc].adc_peripheral_clock, ENABLE );

    /* Initialize the ADC */
    ADC_StructInit( &adc_init_structure );
    /* stm32f1 supports only 12 bit mode */
    adc_init_structure.ADC_ScanConvMode       = DISABLE;
    adc_init_structure.ADC_ContinuousConvMode = DISABLE;
    adc_init_structure.ADC_ExternalTrigConv   = ADC_ExternalTrigConv_None;
    adc_init_structure.ADC_DataAlign          = ADC_DataAlign_Right;
    adc_init_structure.ADC_NbrOfChannel    = 1;
    ADC_Init( adc_mapping[adc].adc, &adc_init_structure );

#if 0
    ADC_CommonInitTypeDef adc_common_init_structure;
    ADC_CommonStructInit(&adc_common_init_structure);
    adc_common_init_structure.ADC_Mode             = ADC_Mode_Independent;
    adc_common_init_structure.ADC_DMAAccessMode    = ADC_DMAAccessMode_Disabled;
    adc_common_init_structure.ADC_Prescaler        = ADC_Prescaler_Div2;
    adc_common_init_structure.ADC_TwoSamplingDelay = ADC_TwoSamplingDelay_5Cycles;
    ADC_CommonInit(&adc_common_init_structure);
#endif
    ADC_Cmd( adc_mapping[adc].adc, ENABLE );

    /* Find the closest supported sampling time by the MCU */
    for ( a = 0; ( a < sizeof( adc_sampling_cycle ) / sizeof(uint16_t) ) && adc_sampling_cycle[a] < sampling_cycle; a++ )
    {
    }

