amlweems/wiced-history/WICED/Platform/common/ARM_Cortex_M3/STM32F1xx/stm32f1xx_platform.c
    /* Initialize the ADC channel */
    ADC_RegularChannelConfig( adc_mapping[adc].adc, adc_mapping[adc].channel, adc_mapping[adc].rank, a );

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    return WICED_SUCCESS;
}

wiced_result_t wiced_adc_take_sample( wiced_adc_t adc, uint16_t* output )
{
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    /* Start conversion */
    ADC_SoftwareStartConvCmd( adc_mapping[adc].adc, ENABLE );

    /* Wait until end of conversion */
    while ( ADC_GetFlagStatus( adc_mapping[adc].adc, ADC_FLAG_EOC ) == RESET )
    {
    }

    /* Read ADC conversion result */
    *output = ADC_GetConversionValue( adc_mapping[adc].adc );

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    return WICED_SUCCESS;
}

wiced_result_t wiced_adc_take_sample_stream( wiced_adc_t adc, void* buffer, uint16_t buffer_length )
{
    UNUSED_PARAMETER(adc);
    UNUSED_PARAMETER(buffer);
    UNUSED_PARAMETER(buffer_length);
    wiced_assert( "unimplemented", 0!=0 );
    return WICED_SUCCESS;
}

wiced_result_t wiced_adc_deinit( wiced_adc_t adc )
{
    UNUSED_PARAMETER(adc);
    wiced_assert( "unimplemented", 0!=0 );
    return WICED_SUCCESS;
}

wiced_result_t wiced_gpio_init( wiced_gpio_t gpio, wiced_gpio_config_t configuration )
{
    GPIO_InitTypeDef gpio_init_structure;
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    RCC_APB2PeriphClockCmd( gpio_mapping[gpio].peripheral_clock, ENABLE );
    gpio_init_structure.GPIO_Speed = GPIO_Speed_50MHz;
    switch( configuration )
    {
        case INPUT_PULL_UP:
            gpio_init_structure.GPIO_Mode = GPIO_Mode_IPU;
            break;
        case INPUT_PULL_DOWN:
            gpio_init_structure.GPIO_Mode = GPIO_Mode_IPD;
            break;
        case INPUT_HIGH_IMPEDANCE:
            gpio_init_structure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
            break;
        case OUTPUT_PUSH_PULL:
            gpio_init_structure.GPIO_Mode = GPIO_Mode_Out_PP;
            break;
        case OUTPUT_OPEN_DRAIN_NO_PULL:
            gpio_init_structure.GPIO_Mode = GPIO_Mode_Out_OD;
            break;
        case OUTPUT_OPEN_DRAIN_PULL_UP:
            gpio_init_structure.GPIO_Mode = GPIO_Mode_IPU;
            break;
        default:
        	return WICED_BADARG;
    }
    gpio_init_structure.GPIO_Pin = (uint16_t) ( 1 << gpio_mapping[gpio].number );
    GPIO_Init( gpio_mapping[gpio].bank, &gpio_init_structure );

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    return WICED_SUCCESS;
}

wiced_result_t wiced_gpio_output_high( wiced_gpio_t gpio )
{
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    GPIO_SetBits( gpio_mapping[gpio].bank, (uint16_t) (1 << gpio_mapping[gpio].number) );

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    return WICED_SUCCESS;
}

wiced_result_t wiced_gpio_output_low( wiced_gpio_t gpio )
{
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    GPIO_ResetBits( gpio_mapping[gpio].bank, (uint16_t) (1 << gpio_mapping[gpio].number) );

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    return WICED_SUCCESS;
}

wiced_bool_t wiced_gpio_input_get( wiced_gpio_t gpio )
{
    wiced_bool_t result;
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    result = GPIO_ReadInputDataBit( gpio_mapping[gpio].bank, (uint16_t) ( 1 << gpio_mapping[gpio].number ) );

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    return result;
}

wiced_result_t wiced_gpio_input_irq_enable( wiced_gpio_t gpio, wiced_gpio_irq_trigger_t trigger, wiced_gpio_irq_handler_t handler, void* arg )
{
    wiced_bool_t result;
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    result = gpio_irq_enable( gpio_mapping[gpio].bank, gpio_mapping[gpio].number, trigger, handler, arg );

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    return result;
}

wiced_result_t wiced_gpio_input_irq_disable( wiced_gpio_t gpio )
{
    wiced_bool_t result;
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    result = gpio_irq_disable( gpio_mapping[gpio].bank, gpio_mapping[gpio].number );

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    return result;
}

wiced_result_t wiced_pwm_init( wiced_pwm_t pwm_peripheral, uint32_t frequency, float duty_cycle )
{
    TIM_TimeBaseInitTypeDef tim_time_base_structure;
    TIM_OCInitTypeDef       tim_oc_init_structure;
    GPIO_InitTypeDef        gpio_init_structure;
    RCC_ClocksTypeDef       rcc_clock_frequencies;
    const platform_pwm_mapping_t* pwm                 = &pwm_mappings[pwm_peripheral];
    uint16_t                      period              = 0;
    float                         adjusted_duty_cycle = ( ( duty_cycle > 100.0f ) ? 100.0f : duty_cycle );

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    RCC_GetClocksFreq( &rcc_clock_frequencies );

    if ( pwm->tim == TIM1 || pwm->tim == TIM8 || pwm->tim == TIM9 || pwm->tim == TIM10 || pwm->tim == TIM11 || pwm->tim == TIM15 || pwm->tim == TIM16 || pwm->tim == TIM17 )
    {
        RCC_APB2PeriphClockCmd( pwm->tim_peripheral_clock, ENABLE );
        period = (uint16_t)( rcc_clock_frequencies.PCLK2_Frequency / frequency - 1 ); /* Auto-reload value counts from 0; hence the minus 1 */
    }
    else
    {
        RCC_APB1PeriphClockCmd( pwm->tim_peripheral_clock, ENABLE );
        period = (uint16_t)( rcc_clock_frequencies.PCLK1_Frequency / frequency - 1 ); /* Auto-reload value counts from 0; hence the minus 1 */
    }

