amlweems/wiced-history/WICED/Platform/common/ARM_Cortex_M3/STM32F1xx/stm32f1xx_platform.c
    RCC_APB2PeriphClockCmd( pwm->pin->peripheral_clock, ENABLE );

    gpio_init_structure.GPIO_Pin = (uint16_t) ( 1 << pwm->pin->number );
    gpio_init_structure.GPIO_Mode = GPIO_Mode_AF_PP;
    gpio_init_structure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init( pwm->pin->bank, &gpio_init_structure );

    /* Time base configuration */
    tim_time_base_structure.TIM_Period            = (uint32_t) period;
    tim_time_base_structure.TIM_Prescaler         = (uint16_t) 1;  /* Divide clock by 1+1 to enable a count of high cycle + low cycle = 1 PWM cycle */
    tim_time_base_structure.TIM_ClockDivision     = 0;
    tim_time_base_structure.TIM_CounterMode       = TIM_CounterMode_Up;
    tim_time_base_structure.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit( pwm->tim, &tim_time_base_structure );

    /* PWM1 Mode configuration */
    tim_oc_init_structure.TIM_OCMode       = TIM_OCMode_PWM1;
    tim_oc_init_structure.TIM_OutputState  = TIM_OutputState_Enable;
    tim_oc_init_structure.TIM_OutputNState = TIM_OutputNState_Enable;
    tim_oc_init_structure.TIM_Pulse        = (uint16_t) ( adjusted_duty_cycle * (float) period / 100.0f );
    tim_oc_init_structure.TIM_OCPolarity   = TIM_OCPolarity_High;
    tim_oc_init_structure.TIM_OCNPolarity  = TIM_OCNPolarity_High;
    tim_oc_init_structure.TIM_OCIdleState  = TIM_OCIdleState_Reset;
    tim_oc_init_structure.TIM_OCNIdleState = TIM_OCIdleState_Set;

    switch(pwm->channel)
    {
        case 1:
        {
            TIM_OC1Init( pwm->tim, &tim_oc_init_structure );
            TIM_OC1PreloadConfig( pwm->tim, TIM_OCPreload_Enable );
            break;
        }
        case 2:
        {
            TIM_OC2Init( pwm->tim, &tim_oc_init_structure );
            TIM_OC2PreloadConfig( pwm->tim, TIM_OCPreload_Enable );
            break;
        }
        case 3:
        {
            TIM_OC3Init( pwm->tim, &tim_oc_init_structure );
            TIM_OC3PreloadConfig( pwm->tim, TIM_OCPreload_Enable );
            break;
        }
        case 4:
        {
            TIM_OC4Init( pwm->tim, &tim_oc_init_structure );
            TIM_OC4PreloadConfig( pwm->tim, TIM_OCPreload_Enable );
            break;
        }
        default:
        {
            break;
        }
    }
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    return WICED_SUCCESS;
}

wiced_result_t wiced_pwm_start( wiced_pwm_t pwm )
{
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    TIM_Cmd(pwm_mappings[pwm].tim, ENABLE);
    TIM_CtrlPWMOutputs( pwm_mappings[pwm].tim, ENABLE );

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    return WICED_SUCCESS;
}

wiced_result_t wiced_pwm_stop( wiced_pwm_t pwm )
{
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    TIM_CtrlPWMOutputs( pwm_mappings[pwm].tim, DISABLE );
    TIM_Cmd(pwm_mappings[pwm].tim, DISABLE);

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    return WICED_SUCCESS;
}

wiced_result_t wiced_watchdog_kick( void )
{
    wiced_result_t result;
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    result = watchdog_kick();

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    return result;

}

wiced_result_t wiced_uart_init( wiced_uart_t uart, const wiced_uart_config_t* config, wiced_ring_buffer_t* optional_rx_buffer )
{
    wiced_result_t result;
#ifndef WICED_DISABLE_STDIO
    if (uart == STDIO_UART)
    {
        return WICED_ERROR;
    }
#endif

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    result = platform_uart_init(uart, config, optional_rx_buffer);

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    return result;
}

static wiced_result_t platform_uart_init( wiced_uart_t uart, const wiced_uart_config_t* config, wiced_ring_buffer_t* optional_rx_buffer )
{
    GPIO_InitTypeDef  gpio_init_structure;
    USART_InitTypeDef usart_init_structure;
    NVIC_InitTypeDef  nvic_init_structure;
//    DMA_InitTypeDef   dma_init_structure;

    host_rtos_init_semaphore(&uart_interfaces[uart].tx_complete);
    host_rtos_init_semaphore(&uart_interfaces[uart].rx_complete);

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    /* Enable GPIO peripheral clocks for TX and RX pins */
    RCC_APB2PeriphClockCmd( uart_mapping[uart].pin_rx->peripheral_clock, ENABLE );
    RCC_APB2PeriphClockCmd( uart_mapping[uart].pin_tx->peripheral_clock, ENABLE );

    /* Configure USART TX Pin */
    gpio_init_structure.GPIO_Pin   = (uint16_t) ( 1 << uart_mapping[uart].pin_tx->number );
    gpio_init_structure.GPIO_Mode  = GPIO_Mode_AF_PP;
    gpio_init_structure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init( uart_mapping[uart].pin_tx->bank, &gpio_init_structure );

    /* Configure USART RX Pin */
    gpio_init_structure.GPIO_Pin   = (uint16_t) ( 1 << uart_mapping[uart].pin_rx->number );
    gpio_init_structure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init( uart_mapping[uart].pin_rx->bank, &gpio_init_structure );

    /* Check if any of the flow control is enabled */
    if ( uart_mapping[uart].pin_cts && (config->flow_control == FLOW_CONTROL_CTS || config->flow_control == FLOW_CONTROL_CTS_RTS) )
    {
        /* Enable peripheral clock */
        RCC_APB2PeriphClockCmd( uart_mapping[uart].pin_cts->peripheral_clock, ENABLE );

        /* Configure CTS Pin */
        gpio_init_structure.GPIO_Pin   = (uint16_t) ( 1 << uart_mapping[uart].pin_cts->number );
        gpio_init_structure.GPIO_Mode  = GPIO_Mode_AF_OD;
        GPIO_Init( uart_mapping[uart].pin_cts->bank, &gpio_init_structure );
    }

    if ( uart_mapping[uart].pin_cts && (config->flow_control == FLOW_CONTROL_RTS || config->flow_control == FLOW_CONTROL_CTS_RTS) )
    {
        /* Enable peripheral clock */
        RCC_APB2PeriphClockCmd( uart_mapping[uart].pin_rts->peripheral_clock, ENABLE );

        /* Configure RTS Pin */
        gpio_init_structure.GPIO_Pin   = (uint16_t) ( 1 << uart_mapping[uart].pin_rts->number );
        gpio_init_structure.GPIO_Mode  = GPIO_Mode_AF_OD;
        GPIO_Init( uart_mapping[uart].pin_rts->bank, &gpio_init_structure );
    }

    /* Enable UART peripheral clock */
    uart_mapping[uart].usart_peripheral_clock_func( uart_mapping[uart].usart_peripheral_clock, ENABLE );

    /**************************************************************************
     * Initialise STM32 USART registers
     * NOTE:
     * - Both transmitter and receiver are disabled until usart_enable_transmitter/receiver is called.
     * - Only 1 and 2 stop bits are implemented at the moment.
     **************************************************************************/
    usart_init_structure.USART_Mode       = 0;
    usart_init_structure.USART_BaudRate   = config->baud_rate;
    usart_init_structure.USART_WordLength = ( ( config->data_width == DATA_WIDTH_9BIT ) ||
                                              ( ( config->data_width == DATA_WIDTH_8BIT ) && ( config->parity != NO_PARITY ) ) ) ? USART_WordLength_9b : USART_WordLength_8b;
    usart_init_structure.USART_StopBits   = ( config->stop_bits == STOP_BITS_1 ) ? USART_StopBits_1 : USART_StopBits_2;

