amlweems/wiced-history/WICED/Platform/common/ARM_Cortex_M3/STM32F1xx/stm32f1xx_platform.c
    switch ( config->parity )
    {
        case NO_PARITY:
            usart_init_structure.USART_Parity = USART_Parity_No;
            break;
        case EVEN_PARITY:
            usart_init_structure.USART_Parity = USART_Parity_Even;
            break;
        case ODD_PARITY:
            usart_init_structure.USART_Parity = USART_Parity_Odd;
            break;
        default:
            return WICED_BADARG;
    }

    switch ( config->flow_control )
    {
        case FLOW_CONTROL_DISABLED:
            usart_init_structure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
            break;
        case FLOW_CONTROL_CTS:
            usart_init_structure.USART_HardwareFlowControl = USART_HardwareFlowControl_CTS;
            break;
        case FLOW_CONTROL_RTS:
            usart_init_structure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS;
            break;
        case FLOW_CONTROL_CTS_RTS:
            usart_init_structure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
            break;
        default:
            return WICED_BADARG;
    }

    /* Initialise USART peripheral */
    USART_Init( uart_mapping[uart].usart, &usart_init_structure );

#ifndef PLATFORM_DISABLE_UART_DMA
    /**************************************************************************
     * Initialise STM32 DMA registers
     * Note: If DMA is used, USART interrupt isn't enabled.
     **************************************************************************/
    /* Enable DMA peripheral clock */
    uart_mapping[uart].tx_dma_peripheral_clock_func( uart_mapping[uart].tx_dma_peripheral_clock, ENABLE );
    uart_mapping[uart].rx_dma_peripheral_clock_func( uart_mapping[uart].rx_dma_peripheral_clock, ENABLE );

    /* Fill init structure with common DMA settings */
//    dma_init_structure.DMA_PeripheralInc   = DMA_PeripheralInc_Disable;
//    dma_init_structure.DMA_MemoryInc       = DMA_MemoryInc_Enable;
//    dma_init_structure.DMA_Priority        = DMA_Priority_VeryHigh;
//
//    if ( config->data_width == DATA_WIDTH_9BIT )
//    {
//        dma_init_structure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
//        dma_init_structure.DMA_MemoryDataSize     = DMA_MemoryDataSize_HalfWord;
//    }
//    else
//    {
//        dma_init_structure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
//        dma_init_structure.DMA_MemoryDataSize     = DMA_MemoryDataSize_Byte;
//    }

    /* Initialise TX DMA */
    uart_mapping[uart].tx_dma_channel->CCR   = 0;
    uart_mapping[uart].tx_dma_channel->CNDTR = 0;
    uart_mapping[uart].tx_dma_channel->CMAR  = (uint32_t)0;
    uart_mapping[uart].tx_dma_channel->CPAR  = (uint32_t) &uart_mapping[uart].usart->DR;
//    DMA_DeInit( uart_mapping[uart].tx_dma_channel );
//    dma_init_structure.DMA_PeripheralBaseAddr = (uint32_t) &uart_mapping[uart].usart->DR;
//    dma_init_structure.DMA_MemoryBaseAddr     = (uint32_t) 0;
//    dma_init_structure.DMA_DIR                = DMA_DIR_PeripheralDST;
//    dma_init_structure.DMA_BufferSize         = 0;
//    dma_init_structure.DMA_Mode               = DMA_Mode_Normal;
//    DMA_Init( uart_mapping[uart].tx_dma_channel, &dma_init_structure );

    /* Initialise RX DMA */
    uart_mapping[uart].rx_dma_channel->CCR   = 0;
    uart_mapping[uart].rx_dma_channel->CNDTR = 0;
    uart_mapping[uart].rx_dma_channel->CMAR  = (uint32_t)0;
    uart_mapping[uart].rx_dma_channel->CPAR  = (uint32_t) &uart_mapping[uart].usart->DR;
//    DMA_DeInit( uart_mapping[uart].rx_dma_channel );
//    dma_init_structure.DMA_PeripheralBaseAddr = (uint32_t) &uart_mapping[uart].usart->DR;
//    dma_init_structure.DMA_MemoryBaseAddr     = 0;
//    dma_init_structure.DMA_DIR                = DMA_DIR_PeripheralSRC;
//    dma_init_structure.DMA_BufferSize         = 0;
//    dma_init_structure.DMA_Mode               = DMA_Mode_Normal;
//    DMA_Init( uart_mapping[uart].rx_dma_channel, &dma_init_structure );

    /**************************************************************************
     * Initialise STM32 DMA interrupts
     * Note: Only TX DMA interrupt is enabled.
     **************************************************************************/

    /* Configure TX DMA interrupt on Cortex-M3 */
    nvic_init_structure.NVIC_IRQChannel                   = uart_mapping[uart].tx_dma_irq;
    nvic_init_structure.NVIC_IRQChannelPreemptionPriority = (uint8_t) 0x5;
    nvic_init_structure.NVIC_IRQChannelSubPriority        = 0x8;
    nvic_init_structure.NVIC_IRQChannelCmd                = ENABLE;
    NVIC_Init( &nvic_init_structure );

    /* Enable TC (transfer complete) and TE (transfer error) interrupts on source */
    DMA_ITConfig( uart_mapping[uart].tx_dma_channel, DMA_IT_TC | DMA_IT_TE, ENABLE );

    /* Enable USART's TX and RX DMA interfaces */
    USART_DMACmd( uart_mapping[uart].usart, USART_DMAReq_Rx | USART_DMAReq_Tx, ENABLE );
#endif

    /**************************************************************************
     * Initialise STM32 USART interrupt
     **************************************************************************/
    nvic_init_structure.NVIC_IRQChannel                   = uart_mapping[uart].usart_irq;
    nvic_init_structure.NVIC_IRQChannelPreemptionPriority = (uint8_t) 0x6;
    nvic_init_structure.NVIC_IRQChannelSubPriority        = 0x7;
    nvic_init_structure.NVIC_IRQChannelCmd                = ENABLE;

    /* Enable USART interrupt vector in Cortex-M3 */
    NVIC_Init( &nvic_init_structure );

    /* Enable USART */
    USART_Cmd( uart_mapping[uart].usart, ENABLE );

    /* Enable both transmit and receive */
    uart_mapping[uart].usart->CR1 |= USART_CR1_TE | USART_CR1_RE;

    /* Setup ring buffers */
    if (optional_rx_buffer != NULL)
    {
        /* Note that the ring_buffer should've been initialised first */
        uart_interfaces[uart].rx_buffer = optional_rx_buffer;
        uart_interfaces[uart].rx_size   = 0;
#ifndef PLATFORM_DISABLE_UART_DMA
        platform_uart_receive_bytes( uart, optional_rx_buffer->buffer, optional_rx_buffer->size, 0 );
#else
        uart_mapping[uart].usart->CR1 |= USART_CR1_RXNEIE;
#endif
    }
    else
    {
#ifndef PLATFORM_DISABLE_UART_DMA
        /* Configure RX DMA interrupt on Cortex-M3 */
       nvic_init_structure.NVIC_IRQChannel                   = uart_mapping[uart].rx_dma_irq;
       nvic_init_structure.NVIC_IRQChannelPreemptionPriority = (uint8_t) 0x5;
       nvic_init_structure.NVIC_IRQChannelSubPriority        = 0x8;
       nvic_init_structure.NVIC_IRQChannelCmd                = ENABLE;
       NVIC_Init( &nvic_init_structure );

       /* Enable TC (transfer complete) and TE (transfer error) interrupts on source */
       DMA_ITConfig( uart_mapping[uart].rx_dma_channel, DMA_IT_TC | DMA_IT_TE, ENABLE );
#endif
    }

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    return WICED_SUCCESS;
}

wiced_result_t wiced_uart_deinit( wiced_uart_t uart )
{
    NVIC_InitTypeDef nvic_init_structure;

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    /* Disable USART */
    USART_Cmd( uart_mapping[uart].usart, DISABLE );

    /* Deinitialise USART */
    USART_DeInit( uart_mapping[uart].usart );

#ifndef PLATFORM_DISABLE_UART_DMA
    /**************************************************************************
     * De-initialise STM32 DMA and interrupt
     **************************************************************************/

    /* Deinitialise DMA streams */
    DMA_DeInit( uart_mapping[uart].tx_dma_channel );
    DMA_DeInit( uart_mapping[uart].tx_dma_channel );

    /* Disable TC (transfer complete) interrupt at the source */
    DMA_ITConfig( uart_mapping[uart].tx_dma_channel, DMA_IT_TC | DMA_IT_TE, DISABLE );

    /* Disable transmit DMA interrupt at Cortex-M3 */
    nvic_init_structure.NVIC_IRQChannel                   = uart_mapping[uart].tx_dma_irq;
    nvic_init_structure.NVIC_IRQChannelPreemptionPriority = (uint8_t) 0x5;
    nvic_init_structure.NVIC_IRQChannelSubPriority        = 0x8;
    nvic_init_structure.NVIC_IRQChannelCmd                = DISABLE;
    NVIC_Init( &nvic_init_structure );

    /* Disable DMA peripheral clocks */
    uart_mapping[uart].tx_dma_peripheral_clock_func( uart_mapping[uart].tx_dma_peripheral_clock, DISABLE );
    uart_mapping[uart].rx_dma_peripheral_clock_func( uart_mapping[uart].rx_dma_peripheral_clock, DISABLE );
#endif

    /**************************************************************************
     * De-initialise STM32 USART interrupt
     **************************************************************************/

    USART_ITConfig( uart_mapping[uart].usart, USART_IT_RXNE, DISABLE );

    /* Disable UART interrupt vector on Cortex-M3 */
    nvic_init_structure.NVIC_IRQChannel                   = uart_mapping[uart].usart_irq;
    nvic_init_structure.NVIC_IRQChannelPreemptionPriority = (uint8_t) 0xf;
    nvic_init_structure.NVIC_IRQChannelSubPriority        = 0xf;
    nvic_init_structure.NVIC_IRQChannelCmd                = DISABLE;
    NVIC_Init( &nvic_init_structure );

    /* Disable registers clocks */
    uart_mapping[uart].usart_peripheral_clock_func( uart_mapping[uart].usart_peripheral_clock, DISABLE );

    host_rtos_deinit_semaphore(&uart_interfaces[uart].rx_complete);
    host_rtos_deinit_semaphore(&uart_interfaces[uart].tx_complete);

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */
    return WICED_SUCCESS;
}

wiced_result_t wiced_uart_transmit_bytes( wiced_uart_t uart, const void* data, uint32_t size )
{
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif

#ifndef PLATFORM_DISABLE_UART_DMA
    /* Reset DMA transmission result. The result is assigned in interrupt handler */
    uart_interfaces[uart].tx_dma_result = WICED_ERROR;
	
