amlweems/wiced-history/WICED/Platform/common/ARM_Cortex_M3/STM32F1xx/stm32f1xx_platform.c
    uart_mapping[uart].tx_dma_channel->CCR   = 0;
    uart_mapping[uart].tx_dma_channel->CNDTR = size;
    uart_mapping[uart].tx_dma_channel->CMAR  = (uint32_t)data;
    uart_mapping[uart].tx_dma_channel->CCR   = DMA_Priority_VeryHigh | DMA_DIR_PeripheralDST | DMA_MemoryInc_Enable | DMA_CCR1_EN | DMA_CCR1_TCIE;

    host_rtos_get_semaphore( &uart_interfaces[uart].tx_complete, WICED_NEVER_TIMEOUT, WICED_TRUE );
    while ( ( uart_mapping[ uart ].usart->SR & USART_SR_TC ) == 0 )
    {
    }

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif

    return uart_interfaces[uart].tx_dma_result;
#else	
    uart_interfaces[uart].tx_buffer = data;
    uart_interfaces[uart].tx_size   = size;
    uart_mapping[uart].usart->CR1  |= USART_CR1_TXEIE;
    host_rtos_get_semaphore( &uart_interfaces[uart].tx_complete, WICED_NEVER_TIMEOUT, WICED_TRUE );
    while( ( uart_mapping[uart].usart->SR & USART_SR_TC )== 0 );

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif

    return WICED_SUCCESS;
#endif
}

wiced_result_t wiced_uart_receive_bytes( wiced_uart_t uart, void* data, uint32_t size, uint32_t timeout )
{
    if (uart_interfaces[uart].rx_buffer != NULL)
    {
        while (size != 0)
        {
            uint32_t transfer_size = MIN(uart_interfaces[uart].rx_buffer->size / 2, size);

            /* Check if ring buffer already contains the required amount of data. */
            if ( transfer_size > ring_buffer_used_space( uart_interfaces[uart].rx_buffer ) )
            {
                /* Set rx_size and wait in rx_complete semaphore until data reaches rx_size or timeout occurs */
                uart_interfaces[uart].rx_size = transfer_size;

                if ( host_rtos_get_semaphore( &uart_interfaces[uart].rx_complete, timeout, WICED_TRUE ) != WICED_SUCCESS )
                {
                    uart_interfaces[uart].rx_size = 0;
                    return WICED_TIMEOUT;
                }

                /* Reset rx_size to prevent semaphore being set while nothing waits for the data */
                uart_interfaces[uart].rx_size = 0;
            }

            size -= transfer_size;

            // Grab data from the buffer
            do
            {
                uint8_t* available_data;
                uint32_t bytes_available;

                ring_buffer_get_data( uart_interfaces[uart].rx_buffer, &available_data, &bytes_available );
                bytes_available = MIN( bytes_available, transfer_size );
                memcpy( data, available_data, bytes_available );
                transfer_size -= bytes_available;
                data = ( (uint8_t*) data + bytes_available );
                ring_buffer_consume( uart_interfaces[uart].rx_buffer, bytes_available );
            } while ( transfer_size != 0 );
        }

        if ( size != 0 )
        {
            return WICED_ERROR;
        }
        else
        {
            return WICED_SUCCESS;
        }
    }
    else
    {
        return platform_uart_receive_bytes( uart, data, size, timeout );
    }
}

static wiced_result_t platform_uart_receive_bytes( wiced_uart_t uart, void* data, uint32_t size, uint32_t timeout )
{
    UNUSED_PARAMETER( uart );
    UNUSED_PARAMETER( data );
    UNUSED_PARAMETER( size );
    UNUSED_PARAMETER( timeout );

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

#ifndef PLATFORM_DISABLE_UART_DMA
    if ( uart_interfaces[uart].rx_buffer != NULL )
    {
        uart_mapping[uart].rx_dma_channel->CCR = DMA_CCR1_CIRC;

        // Enabled individual byte interrupts so progress can be updated
        uart_mapping[uart].usart->CR1 |= USART_CR1_RXNEIE;
//        USART_ITConfig( uart_mapping[uart].usart, USART_IT_RXNE, ENABLE );
    }
    else
    {
        uart_mapping[uart].rx_dma_channel->CCR = 0;
    }

    /* Reset DMA transmission result. The result is assigned in interrupt handler */
    uart_interfaces[uart].rx_dma_result = WICED_ERROR;

    uart_mapping[uart].rx_dma_channel->CNDTR = size;
    uart_mapping[uart].rx_dma_channel->CMAR  = (uint32_t)data;
    uart_mapping[uart].rx_dma_channel->CCR   |= DMA_MemoryInc_Enable | DMA_DIR_PeripheralSRC | DMA_CCR1_EN;

    if ( timeout > 0 )
    {
        host_rtos_get_semaphore( &uart_interfaces[uart].rx_complete, timeout, WICED_TRUE );

#ifdef STOP_MODE_SUPPORT
    	stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

		return uart_interfaces[uart].rx_dma_result;
    }
#endif

#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* #ifdef STOP_MODE_SUPPORT */

    return WICED_SUCCESS;
}

/******************************************************
 *                 DCT Functions
 ******************************************************/

#ifndef WICED_DISABLE_BOOTLOADER
platform_dct_data_t* platform_get_dct( void )
{
    platform_dct_header_t hdr =
    {
        .write_incomplete = 0,
        .is_current_dct = 1,
        .app_valid = 1,
        .mfg_info_programmed = 0,
        .magic_number = BOOTLOADER_MAGIC_NUMBER,
        .load_app_func = NULL
    };

    platform_dct_header_t* dct1 = ((platform_dct_header_t*) PLATFORM_DCT_COPY1_START_ADDRESS);
    platform_dct_header_t* dct2 = ((platform_dct_header_t*) PLATFORM_DCT_COPY2_START_ADDRESS);
    if ( ( dct1->is_current_dct == 1 ) &&
         ( dct1->write_incomplete == 0 ) &&
         ( dct1->magic_number == BOOTLOADER_MAGIC_NUMBER ) )
    {
        return (platform_dct_data_t*)dct1;
    }
    if ( ( dct2->is_current_dct == 1 ) &&
         ( dct2->write_incomplete == 0 ) &&
         ( dct2->magic_number == BOOTLOADER_MAGIC_NUMBER ) )
    {
        return (platform_dct_data_t*)dct2;
    }

    /* Not a valid DCT! */
    /* Erase the first DCT and init it. */
    ERASE_DCT_1();

    platform_write_flash_chunk( PLATFORM_DCT_COPY1_START_ADDRESS, (uint8_t*) &hdr, sizeof(hdr) );

    return (platform_dct_data_t*)dct1;
}

void platform_erase_dct( void )
{
    ERASE_DCT_1();
    ERASE_DCT_2();
}

/* ---------------------------------------------------------------------------------------------
 *  STM32F1 Flash programming limitation (taken from PM0075 section 2.3.3)
 * ---------------------------------------------------------------------------------------------
 * In this mode the CPU programs the main Flash memory by performing standard half-word
 * write operations. The PG bit in the FLASH_CR register must be set. FPEC preliminarily
 * reads the value at the addressed main Flash memory location and checks that it has been
 * erased. If not, the program operation is skipped and a warning is issued by the PGERR bit in
 * FLASH_SR register (the only exception to this is when 0x0000 is programmed. In this case,
 * the location is correctly programmed to 0x0000 and the PGERR bit is not set)
 * ---------------------------------------------------------------------------------------------
 *
 * TODO: Disable interrupts during function
 * Note Function allocates a chunk of memory for the bootloader data on the stack - ensure the stack is big enough
 */
int platform_write_dct( uint16_t data_start_offset, const void* data, uint16_t data_length, int8_t app_valid, void (*func)(void) )
{
    platform_dct_header_t* curr_dct = &platform_get_dct( )->dct_header;
    platform_dct_header_t* new_dct;
    uint32_t write_size;
    uint32_t bytes_after_data    = ( PLATFORM_DCT_COPY1_END_ADDRESS - PLATFORM_DCT_COPY1_START_ADDRESS ) - ( sizeof(platform_dct_header_t) + data_start_offset + data_length );
    uint8_t* orig_section1_start;
    uint8_t* orig_section1_end;
    uint8_t* orig_section2_start;
    uint8_t* orig_section2_end;
    uint8_t* orig_section3_start;
    uint8_t* orig_section3_end;
    uint8_t* section1_start;
    uint8_t* section1_end;
    uint8_t* section2_start;
    uint8_t* section2_end;
    uint8_t* section3_start;
    uint8_t* section3_end;
    uint8_t* orig_section1_src;
    uint8_t* orig_section2_src;
    uint8_t* orig_section3_src;
    uint8_t* section1_src;
    uint8_t* section2_src;
    uint8_t* section3_src;
    int      result = 0;

    char zero_byte[2] = {0};

    platform_dct_header_t hdr =
    {
        .write_incomplete = 1,
        .is_current_dct   = 1,
        .magic_number     = BOOTLOADER_MAGIC_NUMBER
    };

    if ( data_length + data_start_offset > ( PLATFORM_DCT_COPY1_END_ADDRESS - PLATFORM_DCT_COPY1_START_ADDRESS ) )
    {
        /* Data too big to write */
        result = -1;
        goto exit;
    }

