amlweems/wiced-history/WICED/Platform/common/ARM_Cortex_M3/STM32F1xx/stm32f1xx_platform.c
    if ( curr_dct == ((platform_dct_header_t*)PLATFORM_DCT_COPY1_START_ADDRESS) )
    {
        new_dct = (platform_dct_header_t*)PLATFORM_DCT_COPY2_START_ADDRESS;
        /* Erase the non-current dct */
        ERASE_DCT_2();
    }
    else
    {
        new_dct = (platform_dct_header_t*)PLATFORM_DCT_COPY1_START_ADDRESS;
        /* Erase the non-current dct */
        ERASE_DCT_1();
    }

    orig_section1_start = (uint8_t*)&new_dct[1];
    orig_section1_end   = orig_section1_start + data_start_offset;
    orig_section2_start = orig_section1_end;
    orig_section2_end   = orig_section2_start + data_length;
    orig_section3_start = orig_section2_end;
    orig_section3_end   = orig_section3_start + bytes_after_data;
    section1_start      = ( ( (uint32_t)orig_section1_start % 2) != 0 ) ? orig_section1_start + 1 : orig_section1_start;
    section1_end        = ( ( (uint32_t)orig_section1_end   % 2) != 0 ) ? orig_section1_end   - 1 : orig_section1_end;
    section2_start      = ( ( (uint32_t)orig_section2_start % 2) != 0 ) ? orig_section2_start + 1 : orig_section2_start;
    section2_end        = ( ( (uint32_t)orig_section2_end   % 2) != 0 ) ? orig_section2_end   - 1 : orig_section2_end;
    section3_start      = ( ( (uint32_t)orig_section3_start % 2) != 0 ) ? orig_section3_start + 1 : orig_section3_start;
    section3_end        = ( ( (uint32_t)orig_section3_end   % 2) != 0 ) ? orig_section3_end   - 1 : orig_section3_end;
    orig_section1_src   = (uint8_t*)&curr_dct[1];
    orig_section2_src   = (uint8_t*)data;
    orig_section3_src   = (uint8_t*)orig_section1_src + data_start_offset + data_length;
    section1_src        = ( ( (uint32_t)orig_section1_start % 2 ) != 0 ) ? orig_section1_src + 1 : orig_section1_src;
    section2_src        = ( ( (uint32_t)orig_section2_start % 2 ) != 0 ) ? orig_section2_src + 1 : orig_section2_src;
    section3_src        = ( ( (uint32_t)orig_section3_start % 2 ) != 0 ) ? orig_section3_src + 1 : orig_section3_src;

    write_size = (uint32_t)( section1_end - section1_start );
    platform_write_flash_chunk( (uint32_t)section1_start, section1_src, write_size );

    if ( section1_end != section2_start )
    {
        uint8_t data_to_write[2];

        data_to_write[0] = *( orig_section1_src + data_start_offset - 1 );
        data_to_write[1] = *( orig_section2_src );

        platform_write_flash_chunk( (uint32_t)section1_end, data_to_write, 2 );
    }

    if ( memcmp( orig_section1_start, orig_section1_src, (uint32_t)( orig_section1_end - orig_section1_start ) ) != 0 )
    {
        result = -2;
        goto exit;
    }

    write_size = (uint32_t)( section2_end - section2_start );
    platform_write_flash_chunk( (uint32_t)section2_start, section2_src, write_size );

    if ( section2_end != section3_start )
    {
        uint8_t data_to_write[2];

        data_to_write[0] = *( orig_section2_src + data_length - 1 );
        data_to_write[1] = *( orig_section3_src );

        platform_write_flash_chunk( (uint32_t)section2_end, data_to_write, 2 );
    }

    if ( memcmp( orig_section2_start, orig_section2_src, (uint32_t)( orig_section2_end - orig_section2_start ) ) != 0 )
    {
        result = -3;
        goto exit;
    }

    write_size = (uint32_t)( section3_end - section3_start );
    platform_write_flash_chunk( (uint32_t)section3_start, section3_src, write_size );

    if ( memcmp( orig_section3_start, orig_section3_src, (uint32_t)( orig_section3_end - orig_section3_start ) ) != 0 )
    {
        result = -4;
        goto exit;
    }

    hdr.app_valid           = (char) (( app_valid == -1 )? curr_dct->app_valid : app_valid);
    hdr.load_app_func       = func;
    hdr.mfg_info_programmed = curr_dct->mfg_info_programmed;
    hdr.write_incomplete    = 0;
    hdr.is_current_dct      = 1;

    /* Write the header data */
    platform_write_flash_chunk( (uint32_t)new_dct, (uint8_t*) &hdr, sizeof(hdr) );

    /* Verify the header data */
    if ( memcmp( (void*)new_dct, (void*)&hdr, 16 ) != 0 )
    {
        result = -5;
        goto exit;
    }

    /* Mark new DCT as complete and current */
    platform_write_flash_chunk( (uint32_t)&curr_dct->is_current_dct, (uint8_t*) &zero_byte, sizeof(zero_byte) );

    exit:
    return result;
}

int platform_erase_flash( uint16_t start_sector, uint16_t end_sector )
{
    uint32_t i;

    /* Unlock the STM32 Flash */
    FLASH_Unlock( );

    /* Clear any error flags */
    FLASH_ClearFlag( FLASH_FLAG_EOP | FLASH_FLAG_WRPRTERR | FLASH_FLAG_PGERR );

    watchdog_kick( );

    for ( i = start_sector; i < end_sector; i += 1 )
    {
        if ( FLASH_ErasePage( i * PLATFORM_FLASH_PAGE_SIZE + FLASH_START_ADDR ) != FLASH_COMPLETE )
        {
            /* Error occurred during erase. */
            /* TODO: Handle error */
            while ( 1 )
            {
            }
        }
        watchdog_kick( );
    }

    FLASH_Lock( );

    return 0;
}

int platform_write_app_chunk( uint32_t offset, const uint8_t* data, uint32_t size )
{
    return platform_write_flash_chunk( APP_HDR_START_ADDR + offset, data, size );
}

int platform_write_flash_chunk( uint32_t address, const uint8_t* data, uint32_t size )
{
    uint32_t  remainder  = address % sizeof(uint16_t);
    uint16_t* dst_ptr    = ( remainder > 0 ) ? (uint16_t*)((uint8_t*)address - sizeof(uint16_t) + remainder ) : (uint16_t*)address;
    uint8_t*  src_ptr    = (uint8_t*)dst_ptr;
    uint8_t*  data_ptr   = (uint8_t*)data;
    uint8_t*  data_start = (uint8_t*)address;
    uint8_t*  data_end   = data_start + size;

    FLASH_Unlock( );

    /* Clear any error flags */
    FLASH_ClearFlag( FLASH_FLAG_EOP | FLASH_FLAG_WRPRTERR | FLASH_FLAG_PGERR );

    while ( (uint32_t)dst_ptr < (uint32_t)data_end )
    {
        uint8_t   word_to_write[2];
        uint16_t* word_to_write_ptr = (uint16_t*)word_to_write;
        uint16_t  byte;
        FLASH_Status status;

        UNUSED_PARAMETER( word_to_write );

        for ( byte = 0; byte < 2; byte++ )
        {
            if ( ( src_ptr >= data_start ) && ( src_ptr < data_end ) )
            {
                word_to_write[byte] = *data_ptr++;
            }
            else
            {
                word_to_write[byte] = *src_ptr;
            }

            src_ptr++;
        }

        status = FLASH_WRITE_FUNC( (uint32_t)dst_ptr, *word_to_write_ptr );

        if ( status != FLASH_COMPLETE)
        {
            FLASH_ClearFlag( FLASH_FLAG_PGERR );
        }

        dst_ptr++;
    }

    FLASH_Lock();

