amlweems/wiced-history/WICED/Platform/common/ARM_Cortex_M3/STM32F1xx/stm32f1xx_platform.c
    return 0;
}

#endif

/******************************************************
 *            Interrupt Service Routines
 ******************************************************/

void usart1_irq( void )
{
#ifndef PLATFORM_DISABLE_UART_DMA
    // Clear all interrupts. It's safe to do so because only RXNE interrupt is enabled
//    USART1->SR = 0;

    // Update tail
    uart_interfaces[0].rx_buffer->tail = uart_interfaces[0].rx_buffer->size - uart_mapping[0].rx_dma_channel->CNDTR;

    // Notify thread if sufficient data are available
    if ( ( uart_interfaces[0].rx_size > 0 ) && ( ring_buffer_used_space( uart_interfaces[0].rx_buffer ) >= uart_interfaces[0].rx_size ) )
    {
        host_rtos_set_semaphore( &uart_interfaces[0].rx_complete, WICED_TRUE );
        uart_interfaces[0].rx_size = 0;
    }
#else
    if (USART1->SR & USART_SR_RXNE)
    {
        uint8_t data = (uint8_t) (USART1->DR & 0xff);
        ring_buffer_write(uart_interfaces[0].rx_buffer, &data, 1);

        if ( ( uart_interfaces[0].rx_size > 0 ) && ( ring_buffer_used_space( uart_interfaces[0].rx_buffer ) >= uart_interfaces[0].rx_size ) )
        {
            host_rtos_set_semaphore( &uart_interfaces[0].rx_complete, WICED_TRUE );
            uart_interfaces[0].rx_size = 0;
        }
    }

    if (USART1->SR & USART_SR_TXE)
    {
        if (uart_interfaces[0].tx_size != 0)
        {
            USART1->DR = *uart_interfaces[0].tx_buffer;
            ++uart_interfaces[0].tx_buffer;
            --uart_interfaces[0].tx_size;
        }
        else
        {
            if (uart_interfaces[0].tx_buffer != NULL)
            {
                uart_interfaces[0].tx_buffer = NULL;
                uart_mapping[0].usart->CR1 &= (uint16_t) ~USART_CR1_TXEIE;
                USART1->SR = (uint16_t) ~USART_SR_TXE;
                host_rtos_set_semaphore( &uart_interfaces[0].tx_complete, WICED_TRUE );
            }
        }
    }
#endif
}

void usart2_irq( void )
{
    // Clear all interrupts. It's safe to do so because only RXNE interrupt is enabled
    USART2->SR = 0;

    // Update tail
    uart_interfaces[1].rx_buffer->tail = uart_interfaces[1].rx_buffer->size - uart_mapping[1].rx_dma_channel->CNDTR;

    // Notify thread if sufficient data are available
    if ( ( uart_interfaces[1].rx_size > 0 ) && ( ring_buffer_used_space( uart_interfaces[1].rx_buffer ) >= uart_interfaces[1].rx_size ) )
    {
        host_rtos_set_semaphore( &uart_interfaces[1].rx_complete, WICED_TRUE );
        uart_interfaces[1].rx_size = 0;
    }
}
#ifndef PLATFORM_DISABLE_UART_DMA
void usart1_tx_dma_irq( void )
{
    if ( ( uart_mapping[0].tx_dma->ISR & DMA_IFCR_CTCIF4 ) != 0 )
    {
        uart_mapping[0].tx_dma->IFCR |= DMA_IFCR_CTCIF4;
        host_rtos_set_semaphore( &uart_interfaces[0].tx_complete, WICED_TRUE );
    }

    /* TX DMA error */
    if ( ( uart_mapping[0].tx_dma->ISR & DMA_IFCR_CTEIF4 )!= 0 )
    {
        /* Clear interrupt */
    	uart_mapping[0].tx_dma->IFCR |= DMA_IFCR_CTEIF4;
    }
}

void usart2_tx_dma_irq( void )
{
    if ( (uart_mapping[1].tx_dma->ISR & DMA_IFCR_CTCIF6) != 0 )
    {
        uart_mapping[1].tx_dma->IFCR |= DMA_IFCR_CTCIF6;
        host_rtos_set_semaphore( &uart_interfaces[1].tx_complete, WICED_TRUE );
    }

    /* TX DMA error */
    if ( (uart_mapping[1].tx_dma->ISR & DMA_IFCR_CTEIF6) != 0 )
    {
        /* Clear interrupt */
        uart_mapping[1].tx_dma->IFCR |= DMA_IFCR_CTEIF6;
    }
}

void usart1_rx_dma_irq( void )
{
    if ( ( DMA2->ISR & DMA_IFCR_CTCIF5)  != 0 )
    {
        DMA2->IFCR |= DMA_IFCR_CTCIF5;
        host_rtos_set_semaphore( &uart_interfaces[0].rx_complete, WICED_TRUE );
    }

    /* TX DMA error */
    if ( ( DMA2->ISR & DMA_IFCR_CTEIF5 ) != 0 )
    {
        /* Clear interrupt */
        DMA2->IFCR |= DMA_IFCR_CTEIF5;
    }
}

void usart2_rx_dma_irq( void )
{
    if ( ( DMA1->ISR & DMA_IFCR_CTCIF5 ) != 0 )
    {
        DMA1->IFCR |= DMA_IFCR_CTCIF5;
        host_rtos_set_semaphore( &uart_interfaces[1].rx_complete, WICED_TRUE );
//        DMA1_Stream5 ->NDTR = uart_interfaces[1].rx_buffer->size;
    }

    /* TX DMA error */
    if ( ( DMA1->ISR & DMA_IFCR_CTEIF5 ) != 0 )
    {
        /* Clear interrupt */
        DMA1->IFCR |= DMA_IFCR_CTEIF5;
    }
}
#endif

#ifdef __GNUC__
/* STDIO Read/Write functions for Newlib */
void platform_stdio_write( const char* str, uint32_t len )
{
#ifndef WICED_DISABLE_STDIO
    host_rtos_get_semaphore( &stdio_tx_mutex, WICED_NEVER_TIMEOUT, WICED_FALSE );
    wiced_uart_transmit_bytes( STDIO_UART, (void*)str, len );
    host_rtos_set_semaphore( &stdio_tx_mutex, WICED_FALSE );
#else
    UNUSED_PARAMETER( str );
    UNUSED_PARAMETER( len );
#endif
}

void platform_stdio_read( char* str, uint32_t len )
{
#ifndef WICED_DISABLE_STDIO
    host_rtos_get_semaphore( &stdio_rx_mutex, WICED_NEVER_TIMEOUT, WICED_FALSE );
    wiced_uart_receive_bytes( STDIO_UART, (void*)str, len, WICED_NEVER_TIMEOUT );
    host_rtos_set_semaphore( &stdio_rx_mutex, WICED_FALSE );
#else
    UNUSED_PARAMETER( str );
    UNUSED_PARAMETER( len );
#endif
}
#endif /* ifdef __GNUC__ */

#define RTC_INTERRUPT_EXTI_LINE EXTI_Line17

#define ENABLE_INTERRUPTS   __asm("CPSIE i")
#define DISABLE_INTERRUPTS  __asm("CPSID i")

int stm32f2_clock_needed_counter = 0;

#ifdef STOP_MODE_SUPPORT
void stm32f1xx_clocks_needed( void )
{
    DISABLE_INTERRUPTS;
    if ( stm32f2_clock_needed_counter <= 0 )
    {
        SCB->SCR &= (~((unsigned long)SCB_SCR_SLEEPDEEP_Msk));
        stm32f2_clock_needed_counter = 0;
    }
    stm32f2_clock_needed_counter++;
    ENABLE_INTERRUPTS;
}

void stm32f1xx_clocks_not_needed( void )
{
    DISABLE_INTERRUPTS;
    stm32f2_clock_needed_counter--;
    if ( stm32f2_clock_needed_counter <= 0 )
    {
        SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
        stm32f2_clock_needed_counter = 0;
    }
    ENABLE_INTERRUPTS;
}
#endif /* #ifdef STOP_MODE_SUPPORT */

void RTC_init(void)
{
    NVIC_InitTypeDef NVIC_InitStructure;
    EXTI_InitTypeDef EXTI_InitStructure;
    GPIO_InitTypeDef gpio_init_structure;

    /* set external oscillator gpios to high impedance state */
    RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOC, ENABLE );
    gpio_init_structure.GPIO_Pin   = (uint16_t) ( 1 << 14 );
    gpio_init_structure.GPIO_Speed = (GPIOSpeed_TypeDef) 0;
    gpio_init_structure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init( GPIOC, &gpio_init_structure );

