amlweems/wiced-history/WICED/Platform/common/ARM_Cortex_M3/STM32F1xx/stm32f1xx_platform.c
    gpio_init_structure.GPIO_Pin   = (uint16_t) ( 1 << 15 );
    gpio_init_structure.GPIO_Speed = (GPIOSpeed_TypeDef) 0;
    gpio_init_structure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init( GPIOC, &gpio_init_structure );


    /* Enable the PWR clock */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);
    /* Allow access to BKP Domain */
    PWR_BackupAccessCmd(ENABLE);

    /* RTC clock source configuration ------------------------------------------*/
    /* Enable the LSE OSC */
    RCC_LSEConfig(RCC_LSE_ON);
    /* Wait till LSE is ready */
    while(RCC_GetFlagStatus(RCC_FLAG_LSERDY) == RESET)
    {
    }
    /* Select the RTC Clock Source */
    RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE);

    /* Enable the RTC Clock */
    RCC_RTCCLKCmd( ENABLE );
    /* RTC configuration -------------------------------------------------------*/
    /* Wait for RTC APB registers synchronisation */
    RTC_WaitForSynchro();

    /* clear alarm flag in the RTC control register and in , all previous alarms will be cleared */
    RTC_ClearFlag( RTC_FLAG_ALR );
    RTC_WaitForLastTask();
    RTC_ClearITPendingBit( RTC_IT_ALR );
    RTC_WaitForLastTask();
    /* setup a prescaler of the RTC clock to 32 to get 1KHz frequency, RTC counter will get incremented every millisecond */
    RTC_SetPrescaler( 32 );
    RTC_WaitForLastTask();

    /* clear external interrupt line that is wired to the the RTC alarm interrupt */
    EXTI_ClearITPendingBit( RTC_INTERRUPT_EXTI_LINE );
    EXTI_InitStructure.EXTI_Line = RTC_INTERRUPT_EXTI_LINE;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    /* initialise the external interrupt for RTC ALARM trigger */
    EXTI_Init(&EXTI_InitStructure);

    NVIC_InitStructure.NVIC_IRQChannel = RTCAlarm_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init( &NVIC_InitStructure );
    RTC_ITConfig( RTC_IT_ALR, DISABLE );
    /* Prepare Stop-Mode but leave disabled */
//    PWR_ClearFlag(PWR_FLAG_WU);
    PWR->CR |= PWR_CR_LPDS;
    PWR->CR &= (unsigned long)(~(PWR_CR_PDDS));
    SCB->SCR |= ((unsigned long)SCB_SCR_SLEEPDEEP_Msk);
}

#ifdef STOP_MODE_SUPPORT
static uint32_t next_alarm_time = 0;
static wiced_bool_t wake_up_interrupt_triggered = WICED_FALSE;

void wake_up_interrupt_notify( void );
static unsigned long stop_mode_power_down_hook( unsigned long delay_ms );
#else
static unsigned long idle_power_down_hook( unsigned long delay_ms );
#endif

#ifdef STOP_MODE_SUPPORT

void wake_up_interrupt_notify( void )
{
    wake_up_interrupt_triggered = WICED_TRUE;
}


/**
 * This function will return the value of time read from the on board CPU real time clock. Time value must be given in the format of
 * the structure wiced_rtc_time_t
 *
 * @return    WICED_SUCCESS : on success.
 * @return    WICED_ERROR   : if an error occurred with any step
 */
wiced_result_t wiced_platform_get_rtc_time(wiced_rtc_time_t* time)
{
    UNUSED_PARAMETER(time);
    /* just stubs for now */
    return WICED_UNSUPPORTED;
}

/**
 * This function will set MCU RTC time to a new value. Time value must be given in the format of
 * the structure wiced_rtc_time_t
 *
 * @return    WICED_SUCCESS : on success.
 * @return    WICED_ERROR   : if an error occurred with any step
 */
wiced_result_t wiced_platform_set_rtc_time(wiced_rtc_time_t* time)
{
    UNUSED_PARAMETER(time);
    /* just stubs for now */
    return WICED_UNSUPPORTED;
}


unsigned long stop_mode_power_down_hook( unsigned long delay_ms )
{
    /* check if we are about to go to deep sleep, if not we will doe clock gating on a cpu rather */
    /* then on the MCU */
    if ( ( ( SCB->SCR & (unsigned long)SCB_SCR_SLEEPDEEP_Msk) ) != 0 )
    {
        unsigned long retval;
        /* next alarm time will be equal to the number of ticks the system will stay in power down mode */
        if( delay_ms != 0xFFFFFFFF )
        {
            next_alarm_time = delay_ms ;
        }
        else
        {
            next_alarm_time =  0xFFFFFFFF;
        }

        DISABLE_INTERRUPTS;
        SysTick->CTRL &= (~(SysTick_CTRL_TICKINT_Msk|SysTick_CTRL_ENABLE_Msk)); /* systick IRQ off */

        /* clear external interrupt flag that is wired to the RTC ALARM interrupt  */
        EXTI_ClearITPendingBit( RTC_INTERRUPT_EXTI_LINE );
        //PWR_ClearFlag(PWR_FLAG_WU);

        /* reset real time clock counter and set alarm counter */
        RTC_WaitForLastTask();
        RTC_SetCounter(0);
        RTC_WaitForLastTask();
        RTC_SetAlarm( next_alarm_time );
        RTC_WaitForLastTask();
        /* activate alarm */
        /* enable RTC alarm interrupt */
        RTC_ITConfig(RTC_IT_ALR, ENABLE);
        RTC_WaitForLastTask();
        RTC_ClearFlag( RTC_FLAG_ALR );
        /* Enable debug in stop mode */
        DBGMCU->CR |= 0x03;
        ENABLE_INTERRUPTS; /* !!!!!!!! */
        /* wfi instruction must came first after ENABLE_INTERRUPTS otherwise interrupts that occured */
        /* between DISABLE_INTERRUPTS and ENABLE_INTERRUPTS can get processed before the CPU goes to sleep */
        /* if the interrupt which is intended to wake up a CPU is already in pending state */
        /* CPU will jump to the interrupt vector, execute the interrupt handler and clear the pending */
        /* interrupt bit. Afterwards it will jump back to the wfi instruction address */
        /* and go to sleep thinking that the interrupt should come and expecting it */

        /* check whether the wake-up capable interrupt occured, while interrupts were disabled */
        if( wake_up_interrupt_triggered == 0 )
        {
            /* the only place where we can miss a wake up interrupt is 1 instruction gap( read and compare ), when interrupt */
            /* may still be triggered */
            __asm("wfi");
        }
        else
        {
            DISABLE_INTERRUPTS;
            RTC_ITConfig(RTC_IT_ALR, DISABLE);
            SysTick->CTRL |= (SysTick_CTRL_TICKINT_Msk|SysTick_CTRL_ENABLE_Msk);
            wake_up_interrupt_triggered = WICED_FALSE;
            ENABLE_INTERRUPTS;
            return 0;
        }

        DISABLE_INTERRUPTS;
        RTC_WaitForLastTask();
        /* deactivate alarm */
        RTC_ITConfig(RTC_IT_ALR, DISABLE);
        RTC_WaitForLastTask();
        /* setup clocks again, cause they were switched of completely prior to the entry to the stop mode */
        init_clocks( );

        /* systick IRQ on */
        SysTick->CTRL |= (SysTick_CTRL_TICKINT_Msk|SysTick_CTRL_ENABLE_Msk);

        /* find out how many ticks we have been sitting with a power switched off */
        /* this value will be needed by the underlying RTOS to update its timers */
        /* bear in mind that when the clocks are switched of the ticks are no longer received by the RTOS */
        RTC_WaitForSynchro();
        retval = RTC_GetCounter();
        RTC_WaitForLastTask();
        ENABLE_INTERRUPTS;
        wake_up_interrupt_triggered = WICED_FALSE;
        return retval;
    }
    else
    {
        ENABLE_INTERRUPTS;
        __asm("wfi");
        /*system tick is still going when wfi instruction gets executed */
        return 0;
    }


    return 0;

}
#else /* STOP_MODE_SUPPORT */

unsigned long idle_power_down_hook( unsigned long delay_ms  )
{
    UNUSED_PARAMETER( delay_ms );
    ENABLE_INTERRUPTS;
    __asm("wfi");
    return 0;
}

#endif /* STOP_MODE_SUPPORT */

unsigned long platform_power_down_hook( unsigned long delay_ms )
{
#ifdef STOP_MODE_SUPPORT
    return stop_mode_power_down_hook( delay_ms );
#else /* STOP_MODE_SUPPORT */
    return idle_power_down_hook( delay_ms );
#endif /* STOP_MODE_SUPPORT */
}

void RTCAlarm_irq( void )
{
    __set_PRIMASK( 1 );
    EXTI_ClearITPendingBit( RTC_INTERRUPT_EXTI_LINE );
    PWR_ClearFlag(PWR_FLAG_WU);
    RTC_WaitForLastTask();
    RTC_ClearFlag(RTC_FLAG_ALR);
    RTC_WaitForLastTask();
    RTC_ITConfig(RTC_IT_ALR, DISABLE);
    RTC_ClearITPendingBit(RTC_IT_ALR);

    init_clocks( );
    __set_PRIMASK( 0 );
}

void wiced_platform_mcu_enable_powersave( void )
{
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_not_needed();
#endif /* ifdef STOP_MODE_SUPPORT  */
    return;
}

void wiced_platform_mcu_disable_powersave( void )
{
#ifdef STOP_MODE_SUPPORT
    stm32f1xx_clocks_needed();
#endif /* ifdef STOP_MODE_SUPPORT  */
    return;
}

void platform_idle_hook( void )
{
    __asm("wfi");
}

void host_platform_get_mac_address( wiced_mac_t* mac )
{
#ifndef WICED_DISABLE_BOOTLOADER
    memcpy(mac->octet, bootloader_api->get_wifi_config_dct()->mac_address.octet, sizeof(wiced_mac_t));
#else
    UNUSED_PARAMETER( mac );
#endif
}
